Repository: 0xGlitchbyte/ocaml.org
Catalog: gettext/*/LC_MESSAGES/messages.po
Languages: fr

source: %i Package
fr: %i Paquet

source: %i Universe
fr: %i Univers

source: %i Version
fr: %i Versions

source: A bit of everything, this page encapsulates OCaml's presence online, blogposts, videos, and mailing lists all live here.
fr: Un peu de tout, cette page résume la présence d'OCaml en ligne, les articles de blog, les vidéos et les listes de diffusion en direct ici.

source: Academic Excellence
fr: Excellence académique

source: Adopt the best known methods for development from the OCaml community.
fr: Adoptez les meilleures méthodes de développement connues de la communauté OCaml.

source: Around the Web
fr: Sur Internet

source: Authors
fr: Auteurs

source: Before any package update, we run sandboxed matrix builds for boundaries of the dependencies and for each of the dependent packages. A package publication will never break the rest of the ecosystem.
fr: Avant toute mise à jour de paquet, nous exécutons des matrices de compilation en bac à sable pour les limites des dépendances et pour chacun des paquet dépendants. Une publication de paquet ne brisera jamais le reste de l'écosystème.

source: Best Practices
fr: Les meilleures pratiques

source: Browse the third-party packages published in the OCaml ecosystem.
fr: Parcourez les packages tiers publiés dans l'écosystème OCaml.

source: Can't find what you're looking for? Try searching the Archive.
fr: Vous ne trouvez pas ce que vous cherchez ? Essayez de rechercher dans les Archives.

source: Carbon Footprint
fr: Empreinte carbone

source: Catch up on the latest news from the OCaml sphere!
fr: Suivez les dernières actualités de la sphère OCaml !

source: Close menu
fr: Fermer le menu

source: Community
fr: Communauté

source: Continuous Integration
fr: Intégration continue

source: Dependencies
fr: Dépendances

source: Discover the organisations that use OCaml to accomplish their goals.
fr: Découvrez les organisations qui utilisent OCaml pour atteindre leurs objectifs.

source: Download
fr: Télécharger

source: Explore thousands of open-source OCaml packages with their documentation.
fr: Explorez des milliers de packages OCaml open source avec leur documentation.

source: Explore vacancies in projects and companies and see where you could fit in.
fr: Explorez les postes vacants dans les projets et les entreprises et voyez où vous pourriez vous intégrer.

source: Find out about OCaml's history and how it became what it is today.
fr: Découvrez l'histoire d'OCaml et comment il est devenu ce qu'il est aujourd'hui.

source: Focus on your code, and opam takes care of distributing it
fr: Concentrez-vous sur votre code, et opam s'occupe de le distribuer

source: Footer
fr: Bas de page

source: Found %i package.
fr: %i paquet trouvé.

source: Go back home
fr: Retour à la page d'accueil

source: Homepage
fr: Page d'accueil

source: Hosting Providers
fr: Hébergeurs

source: Industrial Users
fr: Utilisateurs industriels

source: Innovation. Community. Security.
fr: Innovation. Communauté. Sécurité.

source: Install
fr: Installer

source: Language
fr: Langage

source: Learn about the academics that research programming language technology.
fr: Renseignez-vous sur les universitaires qui recherchent la technologie des langages de programmation.

source: Learn how to contribute
fr: Apprenez à contribuer

source: Learn how to publish your first opam package today and make it available to the rest of the community.
fr: Apprenez à publier votre premier paquet opam aujourd'hui et à le rendre disponible pour le reste de la communauté.

source: Learn techniques for building tools and applications in OCaml.
fr: Apprenez les techniques de création d'outils et d'applications en OCaml.

source: Legal
fr: Légale

source: License
fr: Licence

source: Maintainers
fr: Mainteneurs

source: News
fr: Nouvelles

source: No License
fr: Pas de licence

source: No table of content
fr: Pas de table des matières

source: OCaml Packages
fr: Paquets OCaml

source: On this page
fr: Sur cette page

source: Opam Package Registry
fr: Registre des paquets Opam

source: Open an issue
fr: Ouvrir un tiquet

source: Open menu
fr: Ouvrir le menu

source: Opportunities
fr: Opportunités

source: Our users have the highest standards for the OCaml ecosystem to run mission-critical applications across a variety of operating systems, and they expect that a package that compiles today will still work a decade from now.
fr: Nos utilisateurs ont les normes les plus élevées pour l'écosystème OCaml pour exécuter des applications critiques sur une variété de systèmes d'exploitation, et ils s'attendent à ce qu'un package qui se compile aujourd'hui fonctionnera encore dans une décennie.

source: Packages
fr: Paquets

source: Page not found
fr: Page non trouvée

source: Please check the URL in the address bar and try again.
fr: Veuillez vérifier l'URL dans la barre d'adresse et réessayer.

source: Principles
fr: Principes

source: Privacy
fr: Vie privée

source: Read about the things that have been achieved using OCaml.
fr: Lisez à propos des choses qui ont été réalisées en utilisant OCaml.

source: Read through the OCaml tutorial, official manual and books.
fr: Lisez le didacticiel OCaml, le manuel officiel et les livres.

source: Resources
fr: Ressources

source: Search
fr: Chercher

source: Search Results
fr: Résultats de recherche

source: Stability
fr: Stabilité

source: Stable Ecosystem
fr: Écosystème stable

source: Start contributing.
fr: Commencez à contribuer.

source: State of the art
fr: État de l'art

source: Success Stories
fr: Réussites

source: Terms
fr: Termes

source: Thank you to our
fr: Merci à nos

source: The opam project and package repository is maintained by a team of developers who ensure that everything is not only running smoothly, but curated to maintain a high degree of metadata quality. This makes it one of the most stable package repositories available today.
fr: Le projet opam et le référentiel de packages sont maintenus par une équipe de développeurs qui s'assurent que tout se déroule non seulement correctement, mais également pour maintenir un haut degré de qualité des métadonnées. Cela en fait l'un des référentiels de packages les plus stables disponibles aujourd'hui.

source: Update / week
fr: Mise à jour / semaine

source: Visit Repository
fr: Visiter le dépôt

source: Why OCaml
fr: Pourquoi OCaml

source: opam is a source-based package manager for OCaml that supports multiple simultaneous compiler installations, flexible package constraints, and a Git-friendly development workflow.<br />It's been in use with the OCaml ecosystem since 2013 and is well maintained.
fr: opam est un gestionnaire de packages basé sur les sources pour OCaml qui prend en charge plusieurs installations de compilateur simultanées, des contraintes de packages flexibles et un flux de travail de développement compatible avec Git.<br />Il est utilisé avec l'écosystème OCaml depuis 2013 et est bien entretenu.

source: opam is the package manager for the OCaml ecosystem
fr: opam est le gestionnaire de paquets pour l'écosystème OCaml

source: opam supports publishing multiple versions of packages simultaneously, and to specify the version constraints to ensure that only compatible revisions are chosen for a build. It comes with a performant constraint solver, a flexible CLI, a well-specified metadata format, and easy access to the package manager logic via OCaml libraries.
fr: opam prend en charge la publication simultanée de plusieurs versions de packages et la spécification des contraintes de version afin de garantir que seules les révisions compatibles sont choisies pour une version. Il est livré avec un solveur de contraintes performant, une CLI flexible, un format de métadonnées bien spécifié et un accès facile à la logique du gestionnaire de packages via les bibliothèques OCaml.

source: package
fr: paquet
